'use strict';

let userBirthDate = prompt("Вкажіть рік народження");
let userCity = prompt("В якому місті ви живете?");
let userSport = prompt("Який ваш улюблений вид спорту?");

if (userBirthDate !== null && userCity !== null && userSport !== null) {
    if (userCity === "Київ" && userSport === "Футбол") {
        alert(
            "Твій вік " +
            (2023 - userBirthDate) +
            ". " +
            "Ти живеш у столиці Україні." +
            ". " +
            "Круто! Хочеш стати Мессі?"
        );
    } else if (userCity === "Вашингтон" && userSport === "Футбол") {
        alert(
            "Твій вік " +
            (2023 - userBirthDate) +
            ". " +
            "Ти живеш у столиці США." +
            ". " +
            "Круто! Хочеш стати Мессі?"
        );
    } else if (userCity === "Лондон" && userSport === "Футбол") {
        alert(
            "Твій вік " +
            (2023 - userBirthDate) +
            ". " +
            "Ти живеш у столиці Великої Британії." +
            ". " +
            "Круто! Хочеш стати Мессі?"
        );
    } else if (
        userCity !== "Лондон" &&
        userCity !== "Вашингтон" &&
        userCity !== "Київ" &&
        userSport === "Футбол"
    ) {
        alert(
            "Твій вік " +
            (2023 - userBirthDate) +
            ". " +
            "Ти живеш у місті " +
            userCity +
            ". " +
            "Круто! Хочеш стати Мессі?"
        );
    }
    /////////
    if (userCity === "Київ" && userSport === "Бокс") {
        alert(
            "Твій вік " +
            (2023 - userBirthDate) +
            ". " +
            "Ти живеш у столиці Україні." +
            ". " +
            "Круто! Хочеш стати Кличко?"
        );
    } else if (userCity === "Вашингтон" && userSport === "Бокс") {
        alert(
            "Твій вік " +
            (2023 - userBirthDate) +
            ". " +
            "Ти живеш у столиці США." +
            ". " +
            "Круто! Хочеш стати Кличко?"
        );
    } else if (userCity === "Лондон" && userSport === "Бокс") {
        alert(
            "Твій вік " +
            (2023 - userBirthDate) +
            ". " +
            "Ти живеш у столиці Великої Британії." +
            ". " +
            "Круто! Хочеш стати Кличко?"
        );
    } else if (
        userCity !== "Лондон" &&
        userCity !== "Вашингтон" &&
        userCity !== "Київ" &&
        userSport === "Бокс"
    ) {
        alert(
            "Твій вік " +
            (2023 - userBirthDate) +
            ". " +
            "Ти живеш у місті " +
            userCity +
            ". " +
            "Круто! Хочеш стати Кличко?"
        );
    }
    /////
    if (userCity === "Київ" && userSport === "Автогонки") {
        alert(
            "Твій вік " +
            (2023 - userBirthDate) +
            ". " +
            "Ти живеш у столиці Україні." +
            ". " +
            "Круто! Хочеш стати Шумахером?"
        );
    } else if (userCity === "Вашингтон" && userSport === "Автогонки") {
        alert(
            "Твій вік " +
            (2023 - userBirthDate) +
            ". " +
            "Ти живеш у столиці США." +
            ". " +
            "Круто! Хочеш стати Шумахером?"
        );
    } else if (userCity === "Лондон" && userSport === "Автогонки") {
        alert(
            "Твій вік " +
            (2023 - userBirthDate) +
            ". " +
            "Ти живеш у столиці Великої Британії." +
            ". " +
            "Круто! Хочеш стати Шумахером?"
        );
    } else if (
        userCity !== "Лондон" &&
        userCity !== "Вашингтон" &&
        userCity !== "Київ" &&
        userSport === "Автогонки"
    ) {
        alert(
            "Твій вік " +
            (2023 - userBirthDate) +
            ". " +
            "Ти живеш у місті " +
            userCity +
            ". " +
            "Круто! Хочеш стати Шумахером?"
        );
    }
}
////////////////////////////////////////////////////////

if (userBirthDate === null && userCity !== null && userSport !== null) {
    if (userCity === "Київ" && userSport === "Футбол") {
        alert(
            "Шкода, що Ви не захотіли ввести свій вік. " +
            "Ти живеш у столиці Україні." +
            ". " +
            "Круто! Хочеш стати Мессі?"
        );
    } else if (userCity === "Вашингтон" && userSport === "Футбол") {
        alert(
            "Шкода, що Ви не захотіли ввести свій вік. " +
            "Ти живеш у столиці США." +
            ". " +
            "Круто! Хочеш стати Мессі?"
        );
    } else if (userCity === "Лондон" && userSport === "Футбол") {
        alert(
            "Шкода, що Ви не захотіли ввести свій вік. " +
            "Ти живеш у столиці Великої Британії." +
            ". " +
            "Круто! Хочеш стати Мессі?"
        );
    } else if (
        userCity !== "Лондон" &&
        userCity !== "Вашингтон" &&
        userCity !== "Київ" &&
        userSport === "Футбол"
    ) {
        alert(
            "Шкода, що Ви не захотіли ввести свій вік. " +
            "Ти живеш у місті " +
            userCity +
            ". " +
            "Круто! Хочеш стати Мессі?"
        );
    }
    /////////
    if (userCity === "Київ" && userSport === "Бокс") {
        alert(
            "Шкода, що Ви не захотіли ввести свій вік. " +
            "Ти живеш у столиці Україні." +
            ". " +
            "Круто! Хочеш стати Кличко?"
        );
    } else if (userCity === "Вашингтон" && userSport === "Бокс") {
        alert(
            "Шкода, що Ви не захотіли ввести свій вік. " +
            "Ти живеш у столиці США." +
            ". " +
            "Круто! Хочеш стати Кличко?"
        );
    } else if (userCity === "Лондон" && userSport === "Бокс") {
        alert(
            "Шкода, що Ви не захотіли ввести свій вік. " +
            "Ти живеш у столиці Великої Британії." +
            ". " +
            "Круто! Хочеш стати Кличко?"
        );
    } else if (
        userCity !== "Лондон" &&
        userCity !== "Вашингтон" &&
        userCity !== "Київ" &&
        userSport === "Бокс"
    ) {
        alert(
            "Шкода, що Ви не захотіли ввести свій вік. " +
            "Ти живеш у місті " +
            userCity +
            ". " +
            "Круто! Хочеш стати Кличко?"
        );
    }
    /////
    if (userCity === "Київ" && userSport === "Автогонки") {
        alert(
            "Шкода, що Ви не захотіли ввести свій вік. " +
            "Ти живеш у столиці Україні." +
            ". " +
            "Круто! Хочеш стати Шумахером?"
        );
    } else if (userCity === "Вашингтон" && userSport === "Автогонки") {
        alert(
            "Шкода, що Ви не захотіли ввести свій вік. " +
            "Ти живеш у столиці США." +
            ". " +
            "Круто! Хочеш стати Шумахером?"
        );
    } else if (userCity === "Лондон" && userSport === "Автогонки") {
        alert(
            "Шкода, що Ви не захотіли ввести свій вік. " +
            "Ти живеш у столиці Великої Британії." +
            ". " +
            "Круто! Хочеш стати Шумахером?"
        );
    } else if (
        userCity !== "Лондон" &&
        userCity !== "Вашингтон" &&
        userCity !== "Київ" &&
        userSport === "Автогонки"
    ) {
        alert(
            "Шкода, що Ви не захотіли ввести свій вік. " +
            "Ти живеш у місті " +
            userCity +
            ". " +
            "Круто! Хочеш стати Шумахером?"
        );
    }
}
////////////////////////////////////////////////////////////////

if (userBirthDate === null && userCity === null && userSport !== null) {
    if (userSport === "Футбол") {
        alert(
            "Шкода, що Ви не захотіли ввести свій вік. " +
            "Шкода, що Ви не захотіли ввести своє місто." +
            ". " +
            "Круто! Хочеш стати Мессі?"
        );
    } else if (userSport === "Футбол") {
        alert(
            "Шкода, що Ви не захотіли ввести свій вік. " +
            "Шкода, що Ви не захотіли ввести своє місто." +
            ". " +
            "Круто! Хочеш стати Мессі?"
        );
    } else if (userSport === "Футбол") {
        alert(
            "Шкода, що Ви не захотіли ввести свій вік. " +
            "Шкода, що Ви не захотіли ввести своє місто." +
            ". " +
            "Круто! Хочеш стати Мессі?"
        );
    }

    /////////
    if (userSport === "Бокс") {
        alert(
            "Шкода, що Ви не захотіли ввести свій вік. " +
            "Шкода, що Ви не захотіли ввести своє місто." +
            ". " +
            "Круто! Хочеш стати Кличко?"
        );
    } else if (userSport === "Бокс") {
        alert(
            "Шкода, що Ви не захотіли ввести свій вік. " +
            "Шкода, що Ви не захотіли ввести своє місто." +
            ". " +
            "Круто! Хочеш стати Кличко?"
        );
    } else if (userSport === "Бокс") {
        alert(
            "Шкода, що Ви не захотіли ввести свій вік. " +
            "Шкода, що Ви не захотіли ввести своє місто." +
            ". " +
            "Круто! Хочеш стати Кличко?"
        );
    }

    /////
    if (userSport === "Автогонки") {
        alert(
            "Шкода, що Ви не захотіли ввести свій вік. " +
            "Шкода, що Ви не захотіли ввести своє місто." +
            ". " +
            "Круто! Хочеш стати Шумахером?"
        );
    } else if (userSport === "Автогонки") {
        alert(
            "Шкода, що Ви не захотіли ввести свій вік. " +
            "Шкода, що Ви не захотіли ввести своє місто." +
            ". " +
            "Круто! Хочеш стати Шумахером?"
        );
    } else if (userSport === "Автогонки") {
        alert(
            "Шкода, що Ви не захотіли ввести свій вік. " +
            "Шкода, що Ви не захотіли ввести своє місто." +
            ". " +
            "Круто! Хочеш стати Шумахером?"
        );
    }
}
